#age = int (input('Введите свой возраст '))
#if age >=18:
#    print ('Добро пожаловать')
#elif age == 0:
#    print('0')
#elif age == 15:
#    print ('Я подумаю')
#else:
#    print ('Иди домой')


#day = input("пн,вт,ср,чт,пт")
#if day == "пн" or day == "вт":
#    print("сегодня не выходной")
#elif day == 'сб' or day == 'вс':
#    print("выходной")
#else:
#    print("не верный формат дня недели")

days = {
    "пн" : "Понедельник",
    "вт" : "Вторник",
    "ср" : "Среда",
    "чт" : "Четверг",
    "пт" : "Пятница",
    "сб" : "Суббота",
    "вс" : "Воскресенье"
}

day = input ('введите день ')

if day in days:
    type_day = "будний" if day in ["пн","вт","ср","чт","пт"] else 'выходной' 
    print(f'сегодня {days[day]}')
else:
    print("неверный тип даты")